# 1. 다음 코드를 람다 함수 형태로 수정할 떄, 알맞은 코드를 작성하시오.
# f = lambda(x,y : x*y)

# 2. 다음과 같이 리스트 컴프리헨션으로 되어 있는 콛를 람다 함수와 map함수를 사용하여 표현
ex = [1,2,3,4,5]
num = [2,2,2,2,2]
sq = list(map(lambda x, y : x ** y, ex,num))
print(sq)

# 3. 패키지 설명으로 틀린 것은?  3,5번

# 4. 다음 그림에서 빈칸에 들어가야 할 파일은?  3번 __init__.py

# 5. 모듈을 호출하는 방법이 아닌 것은?  2번

# 6. 빈칸에 들어갈 적합한 코드를 쓰시오.
# 모르겠다..

# 7. 부모 디렉터리를 기준으로 호출하는 방법은?
if __name__ == '__main__':

# 8. 정답이 나와 있음!
# (가) = 'a'  # append
# (나) = write

# 9. 파일 열기 모드에 따라 들어갈 값
# 쓰기 모드 : 'w'
# 추가 모드 : 'a'
# 읽기 모드 : 'r'

# 10. 사칙연산 프로그램을 불러오는 식
# import calculator

# 11. 다음 코드의 실행 결과는?
# 7
# 3.5
# 2.333333
# 1.75
# 1.4
# 1.166666
# 종료되었습니다.

# 12. 코드를 실행했을 때, 가장 마지막에 출력되는 값은?  3번 h

# 13. 결과값이 바르게 짝지어진 것은? 4번

# 14. 이름과 내용이 잘못 짝지어진 것은? 4번 오탈자 x

# 15. 파일의 종류에 대한 설명으로 틀린 것은? 4번

# 16. 코드의 예측되는 실행 결과
# 숫자가 아닙니다.

# 17. try ~ except문 에서의 예외? 1, 2

# 18. 코드의 실행 결과
# Nor divided by 0

# 19. open문을 with문으로 바꾸기
